README.org
:PROPERTIES:
:header-args:emacs-lisp: :tangle "~/.emacs.d/init.el"
:END:
#+TITLE: Felix's .emacs.d Config

* How to
Keep Emacs config simple and native. What I focus on is Emacs itself and functions.

** Install
- To get source code, =git clone https:/git.savannah.gnu.org/git/emacs.git=
- To build
  #+begin_src shell :dir "~/src/Emacs/emacs/"
    git pull
    make extraclean
    ./autogen.sh
    ./configure --with-native-compilation --with-mailutils --with-xwidgets --with-imagemagick
    make
    make install
  #+end_src

** Config
- Clone .emacs.d to local
  #+begin_src shell
    git clone --recurse-submodules -j8 https://github.com/meifatang/.emacs.d ~/.emacs.d
  #+end_src

Note: The ~site-lisp~ directory contains submodues
Below is the content of my config.

* early-init
:PROPERTIES:
:header-args:emacs-lisp: :tangle "~/.emacs.d/early-init.el"
:END:

For my work machine. Mac mini

* Init
** Proxy
#+begin_src emacs-lisp
  (setq url-proxy-services
        '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
          ("http" . "127.0.0.1:7890")
          ("https" . "127.0.0.1:7890")))
  (setq url-gateway-method 'socks)
  (setq socks-server '("Default server" "127.0.0.1" 7890 5))
#+end_src

To set enviroment
#+begin_src emacs-lisp
  (setenv "http_proxy" "http://127.0.0.1:7890")
  (setenv "https_proxy" "http://127.0.0.1:7890")
  (setenv "all_proxy" "socks5://127.0.0.1:7890")
#+end_src

** Add folder to load path
#+begin_src emacs-lisp
  (defun add-folder-to-load-path (folder)
    "Add folder and subdirs to the `load-path'."
    (unless (member folder load-path)
      (add-to-list 'load-path folder))
    (dolist (f (directory-files folder))
      (let ((name (expand-file-name f folder)))
        (when (and (file-directory-p name)
                   (not (string-prefix-p "." f)))
          (add-folder-to-load-path name)))))

  (add-folder-to-load-path (expand-file-name "site-lisp" user-emacs-directory))
  (add-folder-to-load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

** Add tangle header and footer                                    :ARCHIVE:
#+begin_src emacs-lisp :tangle no
  (defun add-tangle-header-and-footer ()
    (message "running in %s" (buffer-file-name))
    (cond
     ((f-ext? (buffer-file-name) "el")
      (goto-char (point-min))
      (insert ";;; init.el --- -*- lexical-binding: t -*-\n;;; Commentary:\n;;; Code:\n\n")
      (goto-char (point-max))
      (insert "\n\(provide 'init\)
  ;;; init.el ends here\n"))
     (t
      nil))
    (save-buffer))

  (add-hook 'org-babel-post-tangle-hook 'felix/add-tangle-header-and-footer)
#+end_src

** Basic Config
#+begin_src emacs-lisp
  (setq user-full-name "Felix Tang")
  (setq user-mail-address "me@tangmeifa.com")

  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))

  (setq inhibit-startup-message t)
  (setq initial-scratch-message "")

  (setq make-backup-files nil)
  (setq auto-save-default nil)

  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (blink-cursor-mode -1)

  (global-visual-line-mode)

  (server-start)

  (global-set-key (kbd "C-s-f") #'toggle-frame-fullscreen)

  ;;(setq save-interprogram-paste-before-kill t)

  (setq gc-cons-threshold 1000000000) ;; 100M
#+end_src

* Emacs built-in lisp/* files
** a
*** abbrev
*** align
*** [[file:~/src/Emacs/emacs/lisp/allout.el][allout]]
*** [[file:~/src/Emacs/emacs/lisp/allout-widgets.el][allout-widgets]]
*** [[file:~/src/Emacs/emacs/lisp/ansi-color.el][ansi-color]]
*** apropos
*** arc-mode
*** array
*** [[file:~/src/Emacs/emacs/lisp/auth-source-pass.el][auth-source-pass]]
*** auth-source
*** autoarg
*** autoinsert
*** autorevert
*** avoid

** b
*** TODO backtree
*** battery
*** bindings
*** bookmark
*** bs
*** buff-menu
*** button

** c
*** calc/
*** calculator
*** calender/
*** case-table
*** cdl
*** cedet/
*** char-fold
*** chistory
*** cmuscheme
*** color
*** comint
*** completion
*** cus-dep
*** cus-edit
*** cus0face
*** cus-load
*** cus-start
*** cus-theme
*** custom

** d
*** dabbrev
*** delim-col
*** delsel
*** descr-text
*** desktop
*** dframe
*** dired-aux
*** dired-loaddefs
*** dired-x
*** dired
*** dirtrack
*** disp-table
*** display-fill-column-indicator
*** display-line-numbers
*** dnd
*** doc-view
*** dom
*** dos-fns
*** dos-vars
*** dos-w32
*** double
*** dynnamic-setting

** e
*** ebuff-menu
*** echistory
*** ecomplete
*** edmacro
*** ehelp
*** elec-pair
*** electric
*** elide-head
*** emacs-lisp/
*** emacs-lock
*** emulation/
*** env
*** epa-dired
*** epa-file
*** epa-hook
*** epa-ks
*** epa-mail
*** epa
*** epg-config
*** epg
*** erc/
*** eshell/
*** expand
*** ezimage

** f
*** face-remap
*** facemenu
*** faces
*** ffap
*** filecache
*** fileloop
*** filenotify
*** files-x
*** files
*** filesets
*** find-cmd
*** find-dired
*** find-file
*** find-lisp
*** finder-inf
*** finder
*** flow-ctrl
*** foldout
*** follow
*** font-core
*** font-lock
*** format-spec
*** format
*** forms
*** frameset
*** fringe

** g
*** generic 
*** 

* Package
Emacs's package managment is ugly. But I do not care.

** ELPA
#+begin_src emacs-lisp
  (setq package-list '(google-this exec-path-from-shell rime pinentry auctex
                                   rainbow-delimiters sudo-edit which-key ivy counsel amx ivy-rich helpful
                                   csv-mode nginx-mode jenkinsfile-mode dockerfile-mode
                                   undo-tree smart-hungry-delete
                                   expand-region browse-kill-ring
                                   projectile
                                   magit forge
                                   toml-mode yaml-mode ansible csv-mode nginx-mode jenkinsfile-mode
                                   terraform-mode dockerfile-mode docker-compose-mode
                                   go-mode rust-mode julia-mode slime haskell-mode erlang elixir-mode applescript-mode
                                   yasnippet yasnippet-snippets yatemplate
                                   lsp-mode company flycheck
                                   ess
                                   emamux edbi pass logview restclient docker kubernetes jenkins
                                   0x0 elfeed leetcode
                                   ob-async ob-go ob-rust ob-browser ob-dart ob-graphql
                                   ob-http ob-ipython ob-mongo ob-tmux ob-uart ob-restclient ob-elixir
                                   org2ctex org-roam org-roam-ui org-ref
                                   org-noter org-pdftools org-noter-pdftools pdf-tools
                                   hledger-mode telega bongo slack vterm
                                   restart-emacs guix nix-mode nix-env-install nix-buffer pcache))

  (setq package-archives '(("org"   . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("gnu"   . "https://elpa.gnu.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  (dolist (package package-list)
    (unless (package-installed-p package)
      (package-install package)))
#+end_src

** site-lisp/*
Package that is not from ELPA or MELPA

** lisp/*
My custom Code. Include Repository fork from others.

* Interface
** rainbow-delimiters
#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode)
#+end_src

** which-key
https://github.com/justbur/emacs-which-key

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'which-key-mode)
#+end_src

** ido                                                             :ARCHIVE:
#+begin_src emacs-lisp :tangle no
  (ido-ubiquitous-mode 1)
#+end_src

** TODO ivy, swipper, counsel
https://github.com/abo-abo/swiper

(ivy-immediate-done)
https://github.com/abo-abo/swiper/blob/f0b2bc618a84d25c0b3d05314d5d5693c27b2d3e/doc/ivy-help.org#key-bindings-for-single-selection

#+begin_src emacs-lisp
  (ivy-mode)

  (setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
  (setq ivy-initial-inputs-alist '())

  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)

  (setq search-default-mode #'char-fold-to-regexp)

  (global-set-key "\C-s" 'swiper)
  (global-set-key (kbd "C-c C-r") 'ivy-resume)
  (global-set-key (kbd "<f6>") 'ivy-resume)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
  (global-set-key (kbd "<f1> l") 'counsel-find-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  (global-set-key (kbd "C-c g") 'counsel-git)
  (global-set-key (kbd "C-c j") 'counsel-git-grep)
  (global-set-key (kbd "C-c k") 'counsel-ag)
  (global-set-key (kbd "C-x l") 'counsel-locate)
  (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
  (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
#+end_src

*** ivy-rich
https://github.com/Yevgnen/ivy-rich

#+begin_src emacs-lisp
  (require 'ivy-rich)
  (ivy-rich-mode 1)
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
#+end_src

** amx
https://github.com/DarwinAwardWinner/amx

To prioritizing your *most-used* commands in the completion list and showing keyboard shortcuts

** TODO google-this
https://github.com/Malabarba/emacs-google-this

** TODO helpful
https://github.com/Wilfred/helpful

#+begin_src emacs-lisp
  (global-set-key (kbd "C-h f") #'helpful-callable)
  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)

  (global-set-key (kbd "C-c C-d") #'helpful-at-point)
  (global-set-key (kbd "C-h F") #'helpful-function)
  (global-set-key (kbd "C-h C") #'helpful-command)
#+end_src

* Navigation
* Visual
** undo-tree
https://github.com/akhayyat/emacs-undo-tree

=undo-tree-visualize= is awesome

#+begin_src emacs-lisp
  (require 'undo-tree)
  (global-undo-tree-mode)
#+end_src

** TODO smart-hungry-delete
https://github.com/hrehfeld/emacs-smart-hungry-delete

#+begin_src emacs-lisp
  (smart-hungry-delete-add-default-hooks)
  (global-set-key (kbd "<backspace>") 'smart-hungry-delete-backward-char)
  (global-set-key (kbd "C-d") 'smart-hungry-delete-forward-char)
#+end_src

* Editing
** sudo-edit
https://github.com/nflath/sudo-edit

#+begin_src emacs-lisp
  (require 'sudo-edit)
#+end_src

