init.el
(setq url-proxy-services
      '(("no_proxy" . "^\\(localhost\\|10\\..*\\|192\\.168\\..*\\)")
        ("http" . "127.0.0.1:7890")
        ("https" . "127.0.0.1:7890")))
(setq url-gateway-method 'socks)
(setq socks-server '("Default server" "127.0.0.1" 7890 5))

(setenv "http_proxy" "http://127.0.0.1:7890")
(setenv "https_proxy" "http://127.0.0.1:7890")
(setenv "all_proxy" "socks5://127.0.0.1:7890")

(defun add-folder-to-load-path (folder)
  "Add folder and subdirs to the `load-path'."
  (unless (member folder load-path)
    (add-to-list 'load-path folder))
  (dolist (f (directory-files folder))
    (let ((name (expand-file-name f folder)))
      (when (and (file-directory-p name)
                 (not (string-prefix-p "." f)))
        (add-folder-to-load-path name)))))

(add-folder-to-load-path (expand-file-name "site-lisp" user-emacs-directory))
(add-folder-to-load-path (expand-file-name "lisp" user-emacs-directory))

(setq user-full-name "Felix Tang")
(setq user-mail-address "me@tangmeifa.com")

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(setq inhibit-startup-message t)
(setq initial-scratch-message "")

(setq make-backup-files nil)
(setq auto-save-default nil)

(tool-bar-mode -1)
(scroll-bar-mode -1)
(blink-cursor-mode -1)

(global-visual-line-mode)

(server-start)

(global-set-key (kbd "C-s-f") #'toggle-frame-fullscreen)

;;(setq save-interprogram-paste-before-kill t)

(setq gc-cons-threshold 1000000000) ;; 100M

(setq package-list '(google-this exec-path-from-shell rime pinentry auctex
                                 rainbow-delimiters sudo-edit which-key ivy counsel amx ivy-rich helpful
                                 csv-mode nginx-mode jenkinsfile-mode dockerfile-mode
                                 undo-tree smart-hungry-delete
                                 expand-region browse-kill-ring
                                 projectile
                                 magit forge
                                 toml-mode yaml-mode ansible csv-mode nginx-mode jenkinsfile-mode
                                 terraform-mode dockerfile-mode docker-compose-mode
                                 go-mode rust-mode julia-mode slime haskell-mode erlang elixir-mode applescript-mode
                                 yasnippet yasnippet-snippets yatemplate
                                 lsp-mode company flycheck
                                 ess
                                 emamux edbi pass logview restclient docker kubernetes jenkins
                                 0x0 elfeed leetcode
                                 ob-async ob-go ob-rust ob-browser ob-dart ob-graphql
                                 ob-http ob-ipython ob-mongo ob-tmux ob-uart ob-restclient ob-elixir
                                 org2ctex org-roam org-roam-ui org-ref
                                 org-noter org-pdftools org-noter-pdftools pdf-tools
                                 hledger-mode telega bongo slack vterm
                                 restart-emacs guix nix-mode nix-env-install nix-buffer pcache))

(setq package-archives '(("org"   . "https://orgmode.org/elpa/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("gnu"   . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

(dolist (package package-list)
  (unless (package-installed-p package)
    (package-install package)))

(add-hook 'prog-mode-hook #'rainbow-delimiters-mode)

(add-hook 'after-init-hook 'which-key-mode)

(ivy-mode)

(setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
(setq ivy-initial-inputs-alist '())

(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)

(setq search-default-mode #'char-fold-to-regexp)

(global-set-key "\C-s" 'swiper)
(global-set-key (kbd "C-c C-r") 'ivy-resume)
(global-set-key (kbd "<f6>") 'ivy-resume)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
(global-set-key (kbd "C-c g") 'counsel-git)
(global-set-key (kbd "C-c j") 'counsel-git-grep)
(global-set-key (kbd "C-c k") 'counsel-ag)
(global-set-key (kbd "C-x l") 'counsel-locate)
(global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
(define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)

(require 'ivy-rich)
(ivy-rich-mode 1)
(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

(global-set-key (kbd "C-h f") #'helpful-callable)
(global-set-key (kbd "C-h v") #'helpful-variable)
(global-set-key (kbd "C-h k") #'helpful-key)

(global-set-key (kbd "C-c C-d") #'helpful-at-point)
(global-set-key (kbd "C-h F") #'helpful-function)
(global-set-key (kbd "C-h C") #'helpful-command)

(require 'undo-tree)
(global-undo-tree-mode)

(smart-hungry-delete-add-default-hooks)
(global-set-key (kbd "<backspace>") 'smart-hungry-delete-backward-char)
(global-set-key (kbd "C-d") 'smart-hungry-delete-forward-char)

(require 'sudo-edit)
