README.org
** expand-region
https://github.com/magnars/expand-region.el

#+begin_src emacs-lisp
  (global-set-key (kbd "C-=") 'er/expand-region)
#+end_src

** browse-kill-ring
https://github.com/browse-kill-ring/browse-kill-ring
Is Good 

** TODO thing-edit
https://github.com/manateelazycat/thing-edit

#+begin_src emacs-lisp
  (require 'thing-edit)
#+end_src

* Project
** projectile
https://github.com/bbatsov/projectile

#+begin_src emacs-lisp :tangle no
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
#+end_src

* Version Control
** magit
https://github.com/magit/magit

** forge
https://github.com/magit/forge

* Files
** systemd-mode
** toml-mode
** yaml-mode
** ansible
https://github.com/k1LoW/emacs-ansible

#+begin_src emacs-lisp
  (add-hook 'yaml-mode-hook '(lambda () (ansible 1)))
#+end_src

** csv-mode
https://git.savannah.gnu.org/cgit/emacs/elpa.git/?h=externals/csv-mode

#+begin_src emacs-lisp
  (add-hook 'csv-mode-hook 'csv-align-mode)
#+end_src

** nginx-mode
https://github.com/ajc/nginx-mode

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("/nginx/sites-\\(?:available\\|enabled\\)/" . nginx-mode))
#+end_src

** jenkinsfile-mode
https://github.com/john2x/jenkinsfile-mode

** terraform-mode
https://github.com/emacsorphanage/terraform-mode

** dockerfile-mode
https://github.com/spotify/dockerfile-mode

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode))
#+end_src

** docker-compose-mode
https://github.com/meqif/docker-compose-mode

* Languages
** go-mode
https://github.com/dominikh/go-mode.el

** rust-mode
https://github.com/rust-lang/rust-mode

** julia-mode
https://github.com/JuliaEditorSupport/julia-emacs

** slime
For Common lisp

#+begin_src emacs-lisp
  (setq inferior-lisp-program "/usr/local/bin/sbcl")
  (setq slime-contribs '(slime-fancy))
#+end_src

** haskell-mode
** erlang
** elixir-mode

* Programming
** yasnippet, yasnippet-snippets, yatemplate
https://github.com/joaotavora/yasnippet
https://github.com/AndreaCrotti/yasnippet-snippets
https://github.com/joaotavora/yasmate

#+begin_src emacs-lisp
  (require 'yasnippet)
  (require 'yasnippet-snippets)
  (require 'yatemplate)

  (setq yas-snippet-dirs
      '("~/.emacs.d/snippets"))

  (add-hook 'after-init-hook 'yas-global-mode)
#+end_src

** lsp-mode
https://github.com/joaotavora/yasmate

#+begin_src emacs-lisp
  (require 'lsp-mode)
  (add-hook 'sh-mode-hook #'lsp)
  (add-hook 'python-mode #'lsp)
#+end_src

*** TODO dap-mode
https://github.com/emacs-lsp/dap-mode

** company
https://github.com/company-mode/company-mode

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'global-company-mode)
#+end_src

** flycheck
https://github.com/flycheck/flycheck

#+begin_src emacs-lisp :tangle no
 (global-flycheck-mode)
#+end_src

* Shell
** exec-path-from-shell
https://github.com/purcell/exec-path-from-shell

#+begin_src emacs-lisp
  (require 'exec-path-from-shell)
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
#+end_src

* ESS

* DevOps
** emamux
https://github.com/emacsorphanage/emamux

** edbi
https://github.com/kiwanami/emacs-edbi

** pass
https://orgmode.org/manual/Tracking-your-habits.html

** logview
https://github.com/doublep/logview

** restclient
https://github.com/pashky/restclient.el

** kubernetes
https://github.com/kubernetes-el/kubernetes-el

** docker
https://github.com/Silex/docker.el

** jenkins
https://github.com/rmuslimov/jenkins.el

** ecloud
https://github.com/meifatang/ecloud Fork from https://github.com/techniumlabs/ecloud

Install Require: =pcache=

#+begin_src emacs-lisp
  (require 'ecloud)
#+end_src

** password-generator
https://github.com/vandrlexay/emacs-password-genarator

#+begin_src emacs-lisp
  (require 'password-generator)
#+end_src

* Internet
** 0x0
** elfeed
https://github.com/skeeto/elfeed

#+begin_src emacs-lisp
  (setq elfeed-feeds
      '("http://nullprogram.com/feed/"
        "https://planet.emacslife.com/atom.xml"
        "https://www.lujun9972.win/rss.xml"
        ))
#+end_src

** leetcode
https://github.com/kaiwk/leetcode.el

#+begin_src emacs-lisp
  (setq leetcode-save-solutions t)
  (setq leetcode-directory "~/leetcode")
#+end_src

* Org
** org
#+begin_src emacs-lisp
  (setq org-startup-indented t)
  (setq org-hide-emphasis-markers t)
#+end_src

** valign-mode                                                     :ARCHIVE:
https://github.com/casouri/valign

#+begin_src emacs-lisp :tangle no
  (add-hook 'org-mode-hook #'valign-mode)
#+end_src

** Ob-*
*** ob-async
https://github.com/astahlman/ob-async

*** ob-go
https://github.com/ali2210/emacs--ob-go

*** ob-rust
https://github.com/zweifisch/ob-rust

*** ob-browser
https://github.com/krisajenkins/ob-browser

*** ob-dart
https://github.com/mzimmerm/ob-dart

*** ob-graphql
https://github.com/jdormit/ob-graphql

*** ob-http
https://github.com/zweifisch/ob-http

*** ob-ipython
https://github.com/gregsexton/ob-ipython

*** ob-mongo
https://github.com/krisajenkins/ob-mongo

*** ob-tmux
https://github.com/ahendriksen/ob-tmux

*** ob-uart
https://github.com/andrmuel/ob-uart

*** ob-restclient
https://github.com/alf/ob-restclient.el

** org-babel
#+begin_src emacs-lisp
  (setq org-babel-python-command "python3")
  ;;(setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (C . t)
     (shell . t)
     (go . t)
     (lisp . t)
     (http . t)
     (clojure . t)
     (sql . t)
     (js . t)
     ;;(ts . t)
     (dot . t)
     (elixir . t)
     (julia . t)
     (R . t)
     (octave . t)
     (java . t)
     (haskell . t)
     (ruby . t)
     (rust . t)))
#+end_src

** org-todo
#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "|" "DONE(d)")
          (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
          (sequence "|" "CANCELED(c)")))

  (setq org-log-done 'time)
  (setq org-log-done 'note)
#+end_src

** org-capture
#+begin_src emacs-lisp
   ;;(setq org-default-notes-file (concat org-directory "/notes.org"))
   (setq org-capture-templates
         '(("g" "Gettting Things Done" entry (file+headline "~/org/Self/gtd.org" "Tasks")
            "* TODO %?\n  %i\n  %a")

           ;; Inbox, Journal
           ("i" "Inbox" entry (file+olp+datetree "~/org/Self/inbox.org")
            "* %?\nEntered on %U\n  %i\n  %a")
           ("j" "Journal" entry (file+olp+datetree "~/org/Self/journal.org")
            "* %?\nEntered on %U\n  %i\n  %a")
           
           ;; Health
           ("d" "Diet" entry (file+olp+datetree "~/org/Self/diet.org")
            "* %?\nEntered on $U\n  %i\n  %a")
           ("h" "Health" entry (file+olp+datetree "~/org/Self/health.org")
            "* %?\nEntered on $U\n  %i\n  %a")
           ("f" "Fitness" entry (file+olp+datetree "~/org/Self/fitness.org")
            "* %?\nEntered on $U\n  %i\n  %a")

           ;; Grow
           ("r" "Read" entry (file+olp+datetree "~/org/Self/read.org")
            "* %?\nEntered on $U\n  %i\n  %a")
           ("l" "Learn" entry (file+olp+datetree "~/org/Self/learn.org")
            "* %?\nEntered on $U\n  %i\n  %a")

           ;; Finance
           ("F" "Finance" plain
            (file "~/org/Self/Finance/finance.journal")
            "%(org-read-date) %^{Description}
       %^{Category|Expenses:Food:Groceries|Expenses:Food:Dining|Expenses:Transport|Expenses:Home|Expenses:Entertainment|Revenues:Salary|Revenues:Misc}    %^{Amount}
       %^{Asset/Liability Account|Assets:Bank:Checking|Assets:Cash|Liabilities:Bank:Credit Card}"
            :empty-lines 1)

           ("e" "Entertainment")
           ("em" "Movie" entry (file+olp+datetree "~/org/Self/entertainments.org" "Movie")
            "* %?\nEntered on $U\n  %i\n  %a")
           ("et" "TV Show" entry (file+olp+datetree "~/org/Self/entertainments.org" "TV")
            "* %?\nEntered on $U\n  %i\n  %a")

           ("3" "fzm")
           ("3t" "fzm's Todo" entry (file+headline "~/org/fzm/fzm-gtd.org" "Tasks")
            "* TODO %?\n  %i\n  %a")
           ("3l" "fzm's Work Log" entry (file+olp+datetree "~/org/fzm/fzm-log.org")
            "* %?\nEntered on %U\n  %i\n  %a")

           ))
#+end_src

*** key
*** description
*** type
**** entry
**** item
**** checkitem
**** table-line
**** plain

*** target
**** file
**** id
**** file+headline
**** file+olp
**** file-regexp
**** file+datetree
**** file+datetree+prompt
**** file+weektree
**** file+weektree+promt
**** file+function
**** clock
**** function

*** template

** org-agenda
#+begin_src emacs-lisp
  (setq org-agenda-files '("~/org/33cn/gtd.org" "~/org/gtd.org"))
#+end_src

** org-superstart-mode
https://github.com/sabof/org-bullets

#+begin_src emacs-lisp
  ;;(require 'org-superstar)
  ;;(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src

** org2ctex
https://github.com/tumashu/org2ctex

#+begin_src emacs-lisp
  (require 'org2ctex)
  (org2ctex-toggle t)
#+end_src

** org-roam
https://github.com/org-roam/org-roam

#+begin_src emacs-lisp
  (setq org-roam-directory "~/org")
  (setq org-roam-v2-ack t)
  (setq org-roam-completion-everywhere t)

  (add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-direction)
               (direction . right)
               (window-width . 0.33)
               (window-height . fit-window-to-buffer)))

  (org-roam-db-autosync-mode)
  ;;(add-hook 'org-roam-find-file-hook 'org-roam-buffer)

  (global-set-key (kbd "C-x j r") #'org-roam-node-random)
  (global-set-key (kbd "C-x j f") #'org-roam-node-find)
  (global-set-key (kbd "C-x j i") #'org-roam-node-insert)
  (global-set-key (kbd "C-x j t") #'org-roam-tag-add)
#+end_src

*** org-roam-ui
https://github.com/org-roam/org-roam-ui

** org-ref
https://github.com/jkitchin/org-ref

* Miscellaneous
** pinentry
#+begin_src emacs-lisp
  (setq epa-pinentry-mode 'loopback)
  (pinentry-start)
#+end_src
** hledger
https://gist.github.com/simonmichael/92aade653065ed9c9e215d03651b0baa

#+begin_src emacs-lisp
  (require 'hledger-mode)
  (add-to-list 'auto-mode-alist '("\\.journal\\'" . hledger-mode))
  (setq hledger-jfile "~/org/Self/finance/finance.journal")
#+end_src

** vterm
** slack
** bongo
** TODO Podcast
#+begin_src
"https://pinecast.com/feed/emacscast"
"https://liuyandong.com/feed/podcast"  
#+end_src

** rime
https://github.com/DogLooksGood/emacs-rime

#+begin_src emacs-lisp
  (setq default-input-method "rime")
  (setq rime-librime-root "~/.emacs.d/librime/dist")
#+end_src

