init.el

(global-set-key (kbd "C-=") 'er/expand-region)

(require 'thing-edit)

(add-hook 'yaml-mode-hook '(lambda () (ansible 1)))

(add-hook 'csv-mode-hook 'csv-align-mode)

(add-to-list 'auto-mode-alist '("/nginx/sites-\\(?:available\\|enabled\\)/" . nginx-mode))

(add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode))

(setq inferior-lisp-program "/usr/local/bin/sbcl")
(setq slime-contribs '(slime-fancy))

(require 'yasnippet)
(require 'yasnippet-snippets)
(require 'yatemplate)

(setq yas-snippet-dirs
    '("~/.emacs.d/snippets"))

(add-hook 'after-init-hook 'yas-global-mode)

(require 'lsp-mode)
(add-hook 'sh-mode-hook #'lsp)
(add-hook 'python-mode #'lsp)

(add-hook 'after-init-hook 'global-company-mode)

(require 'exec-path-from-shell)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))

(require 'ecloud)

(require 'password-generator)

(setq elfeed-feeds
    '("http://nullprogram.com/feed/"
      "https://planet.emacslife.com/atom.xml"
      "https://www.lujun9972.win/rss.xml"
      ))

(setq leetcode-save-solutions t)
(setq leetcode-directory "~/leetcode")

(setq org-startup-indented t)
(setq org-hide-emphasis-markers t)

(setq org-babel-python-command "python3")
;;(setq org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (C . t)
   (shell . t)
   (go . t)
   (lisp . t)
   (http . t)
   (clojure . t)
   (sql . t)
   (js . t)
   ;;(ts . t)
   (dot . t)
   (elixir . t)
   (julia . t)
   (R . t)
   (octave . t)
   (java . t)
   (haskell . t)
   (ruby . t)
   (rust . t)))

(setq org-todo-keywords
      '((sequence "TODO(t)" "|" "DONE(d)")
        (sequence "REPORT(r)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
        (sequence "|" "CANCELED(c)")))

(setq org-log-done 'time)
(setq org-log-done 'note)

;;(setq org-default-notes-file (concat org-directory "/notes.org"))
(setq org-capture-templates
      '(("g" "Gettting Things Done" entry (file+headline "~/org/Self/gtd.org" "Tasks")
         "* TODO %?\n  %i\n  %a")

        ;; Inbox, Journal
        ("i" "Inbox" entry (file+olp+datetree "~/org/Self/inbox.org")
         "* %?\nEntered on %U\n  %i\n  %a")
        ("j" "Journal" entry (file+olp+datetree "~/org/Self/journal.org")
         "* %?\nEntered on %U\n  %i\n  %a")

        ;; Health
        ("d" "Diet" entry (file+olp+datetree "~/org/Self/diet.org")
         "* %?\nEntered on $U\n  %i\n  %a")
        ("h" "Health" entry (file+olp+datetree "~/org/Self/health.org")
         "* %?\nEntered on $U\n  %i\n  %a")
        ("f" "Fitness" entry (file+olp+datetree "~/org/Self/fitness.org")
         "* %?\nEntered on $U\n  %i\n  %a")

        ;; Grow
        ("r" "Read" entry (file+olp+datetree "~/org/Self/read.org")
         "* %?\nEntered on $U\n  %i\n  %a")
        ("l" "Learn" entry (file+olp+datetree "~/org/Self/learn.org")
         "* %?\nEntered on $U\n  %i\n  %a")

        ;; Finance
        ("F" "Finance" plain
         (file "~/org/Self/Finance/finance.journal")
         "%(org-read-date) %^{Description}
    %^{Category|Expenses:Food:Groceries|Expenses:Food:Dining|Expenses:Transport|Expenses:Home|Expenses:Entertainment|Revenues:Salary|Revenues:Misc}    %^{Amount}
    %^{Asset/Liability Account|Assets:Bank:Checking|Assets:Cash|Liabilities:Bank:Credit Card}"
         :empty-lines 1)

        ("e" "Entertainment")
        ("em" "Movie" entry (file+olp+datetree "~/org/Self/entertainments.org" "Movie")
         "* %?\nEntered on $U\n  %i\n  %a")
        ("et" "TV Show" entry (file+olp+datetree "~/org/Self/entertainments.org" "TV")
         "* %?\nEntered on $U\n  %i\n  %a")

        ("3" "fzm")
        ("3t" "fzm's Todo" entry (file+headline "~/org/fzm/fzm-gtd.org" "Tasks")
         "* TODO %?\n  %i\n  %a")
        ("3l" "fzm's Work Log" entry (file+olp+datetree "~/org/fzm/fzm-log.org")
         "* %?\nEntered on %U\n  %i\n  %a")

        ))

(setq org-agenda-files '("~/org/33cn/gtd.org" "~/org/gtd.org"))

;;(require 'org-superstar)
;;(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

(require 'org2ctex)
(org2ctex-toggle t)

(setq org-roam-directory "~/org")
(setq org-roam-v2-ack t)
(setq org-roam-completion-everywhere t)

(add-to-list 'display-buffer-alist
           '("\\*org-roam\\*"
             (display-buffer-in-direction)
             (direction . right)
             (window-width . 0.33)
             (window-height . fit-window-to-buffer)))

(org-roam-db-autosync-mode)
;;(add-hook 'org-roam-find-file-hook 'org-roam-buffer)

(global-set-key (kbd "C-x j r") #'org-roam-node-random)
(global-set-key (kbd "C-x j f") #'org-roam-node-find)
(global-set-key (kbd "C-x j i") #'org-roam-node-insert)
(global-set-key (kbd "C-x j t") #'org-roam-tag-add)

(setq epa-pinentry-mode 'loopback)
(pinentry-start)

(require 'hledger-mode)
(add-to-list 'auto-mode-alist '("\\.journal\\'" . hledger-mode))
(setq hledger-jfile "~/org/Self/finance/finance.journal")

(setq default-input-method "rime")
(setq rime-librime-root "~/.emacs.d/librime/dist")
