README.org
** TODO telega
#+begin_src emacs-lisp
  ;; (setq telega-chat-show-avatars nil)
  ;; (setq telega-root-show-avatars nil)
  ;; (setq telega-user-show-avatars nil)
  ;; (setq telega-active-locations-show-avatars nil)
  ;; (setq telega-company-username-show-avatars nil)

  (setq telega-proxies (list '(:server "127.0.0.1" :port 7890 :enable t
                                       :type (:@type "proxyTypeSocks5"))))
#+end_src

** guix
https://notabug.org/alezost/emacs-guix

** nix
*** nix-mode
https://github.com/NixOS/nix-mode

*** nix-env-install
https://github.com/akirak/nix-env-install

*** nix-buffer
https://github.com/shlevy/nix-buffer

** midnight-mode
#+begin_src emacs-lisp
  (midnight-mode)
#+end_src

** restart-emacs
https://github.com/iqbalansari/restart-emacs

** lisp/geoip.el
Copy from https://github.com/NicolasPetton/emacs.d/blob/master/local/geoip.el

[[file:lisp/geoip.el][geoip.el]]

#+begin_src emacs-lisp
  (require 'geoip)
#+end_src

* Felix's Functions
:PROPERTIES:
:header-args:emacs-lisp: :tangle "~/.emacs.d/lisp/felix.el"
:END:

[[file:lisp/felix.el][felix.el]]

** open-with-vscode
#+begin_src emacs-lisp
  (defun open-with-vscode ()
    "Open current file with vscode."
    (interactive)
    (let ((line (number-to-string (line-number-at-pos)))
          (column (number-to-string (current-column))))
      (apply 'call-process "code" nil nil nil (list (concat buffer-file-name ":" line ":" column) "--goto"))))
#+end_src

** TODO things custom to add ip thing

** provide-function
#+begin_src emacs-lisp
  (provide 'felix)
#+end_src

* Felix's Theme
:PROPERTIES:
:header-args:emacs-lisp: :tangle "~/.emacs.d/felix-theme.el"
:END:
** deftheme
#+begin_src emacs-lisp
  (deftheme felix
    "Created 2021-12-05.")
#+end_src

** custom-theme-set-variables
** custom-theme-set-faces
#+begin_src emacs-lisp
  (custom-theme-set-faces
   'felix

   ;; org custom
   '(org-level-1 ((t (:inherit outline-1 :extend nil :weight bold))))
   '(org-level-2 ((t (:inherit outline-2 :extend nil :weight bold))))
   '(org-level-3 ((t (:inherit outline-3 :extend nil :weight bold))))
   '(org-level-4 ((t (:inherit outline-4 :extend nil :weight bold))))
   '(org-level-5 ((t (:inherit outline-5 :extend nil :weight bold))))
   '(org-level-6 ((t (:inherit outline-6 :extend nil :weight bold))))
   '(org-level-7 ((t (:inherit outline-7 :extend nil :weight bold))))
   '(org-level-8 ((t (:inherit outline-8 :extend nil :weight bold))))
   )
#+end_src

** provide-theme
#+begin_src emacs-lisp
  (provide-theme 'felix)
#+end_src

* The End
** load-theme
#+begin_src emacs-lisp
  (load-theme 'felix t)
#+end_src

** Private
#+begin_src emacs-lisp
  (when (file-exists-p (expand-file-name "init-private.el" user-emacs-directory))
    (load-file (expand-file-name "init-private.el" user-emacs-directory)))
#+end_src

Bye!
