init.el

;; (setq telega-chat-show-avatars nil)
;; (setq telega-root-show-avatars nil)
;; (setq telega-user-show-avatars nil)
;; (setq telega-active-locations-show-avatars nil)
;; (setq telega-company-username-show-avatars nil)

(setq telega-proxies (list '(:server "127.0.0.1" :port 7890 :enable t
                                     :type (:@type "proxyTypeSocks5"))))

(midnight-mode)

(require 'geoip)

(load-theme 'felix t)

(when (file-exists-p (expand-file-name "init-private.el" user-emacs-directory))
  (load-file (expand-file-name "init-private.el" user-emacs-directory)))
